---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.UnsatisfiedWallAssocProp
source: html/036969d8-a8a5-5cc8-c684-252dfbd53161.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.UnsatisfiedWallAssocProp Property

Constraint between a Line created with Pick Wall and the Wall is not satisfied.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnsatisfiedWallAssocProp { get; }
```